In [2]:
#pip install pandas

In [3]:
# Importing Libraries 

import numpy as np
import pandas as pd

## Series

In [4]:
obj = pd.Series([4,5,-5,2])
obj

0    4
1    5
2   -5
3    2
dtype: int64

In [5]:
# index 
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj.array

<PandasArray>
[4, 5, -5, 2]
Length: 4, dtype: int64

In [7]:
# creating user based index
obj2 = pd.Series([4,5,-5,2], index = ['a','b','c','d'])
obj2

a    4
b    5
c   -5
d    2
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj2["a"]

4

In [10]:
obj2['d'] = 6
obj2

a    4
b    5
c   -5
d    6
dtype: int64

In [11]:
obj2[['b','c']]

b    5
c   -5
dtype: int64

In [12]:
obj2>0

a     True
b     True
c    False
d     True
dtype: bool

In [13]:
obj2*2

a     8
b    10
c   -10
d    12
dtype: int64

In [14]:
np.exp(obj2)

a     54.598150
b    148.413159
c      0.006738
d    403.428793
dtype: float64

In [15]:
"b" in obj2

True

In [16]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [17]:
# making series from dictionary
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# converting series to dictionary
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
states = ["California", "Ohio", "Oregon", "Texas"]
states

['California', 'Ohio', 'Oregon', 'Texas']

In [20]:
obj4 = pd.Series(sdata, states) # data and Index
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
# checking null and nas

pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
obj4.name = 'population'

In [28]:
obj4.index.name = 'state'

In [30]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

## DataFrame

In [31]:
# Creating dataframe

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
 "year": [2000, 2001, 2002, 2001, 2002, 2003],
 "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [32]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [33]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [34]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
# sequence the columns

pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [36]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [37]:
# selecting columns 

frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [38]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [39]:
# loc - which is label based 
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [42]:
# lets fill value to debt 

frame2['debt'] = 1000
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  1000
1  2001    Ohio  1.7  1000
2  2002    Ohio  3.6  1000
3  2001  Nevada  2.4  1000
4  2002  Nevada  2.9  1000
5  2003  Nevada  3.2  1000

In [43]:
frame2['debt'] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [44]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [45]:
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [46]:
frame2['eastern'] = frame2['state'] =='Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [47]:
frame2['state'] =='Ohio'

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [48]:
# deleting columns from the DF 

del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [49]:
# Nested dictionaries 

populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
    "Nevada": {2001: 2.4, 2002: 2.9}}
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [50]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [51]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [52]:
#Name attribute of DataFrame columns and index
frame3.index.name = 'year'
frame3.columns.name = 'states'

In [53]:
frame3

states  Ohio  Nevada
year
2000     1.5     NaN
2001     1.7     2.4
2002     3.6     2.9

In [54]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# index Object

In [55]:
obj = pd.Series(np.arange(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int32

In [56]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [57]:
index[1:]

Index(['b', 'c'], dtype='object')

In [58]:
# Index are immutable and cannot be modified 
index[1] = 'd'

TypeError: Index does not support mutable operations

In [59]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [60]:
obj2 = pd.Series([1,4,2], index=labels)
obj2

0    1
1    4
2    2
dtype: int64

In [61]:
frame3

states  Ohio  Nevada
year
2000     1.5     NaN
2001     1.7     2.4
2002     3.6     2.9

In [62]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='states')

In [63]:
'Ohio' in frame3

True

In [65]:
2001 in frame3.index

True

## Reindexing

In [66]:
obj = pd.Series([3,52,5,2], index=['d','b','a','c'])
obj

d     3
b    52
a     5
c     2
dtype: int64

In [67]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a     5.0
b    52.0
c     2.0
d     3.0
e     NaN
dtype: float64

## METHOD - ffill

In [68]:
obj3 = pd.Series(["blue", 'purple', "yellow"], index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [69]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [70]:
frame = pd.DataFrame(np.arange(9.).reshape(3,3),
 index=["a", "c", "d"],
 columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a   0.0    1.0         2.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [71]:
frame2 = frame.reindex(['a','b','c','d','e'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [72]:
frame3 = frame2.reindex(columns=["Ohio","Texas", "California", "NY"])
frame3

   Ohio  Texas  California  NY
a   0.0    1.0         2.0 NaN
b   NaN    NaN         NaN NaN
c   3.0    4.0         5.0 NaN
d   6.0    7.0         8.0 NaN
e   NaN    NaN         NaN NaN

In [75]:
frame3.loc[['a','c'], ['Texas']]

   Texas
a    1.0
c    4.0

# Dropping entries from an axis

In [78]:
obj = frame3['Ohio'].fillna(10)
obj

a     0.0
b    10.0
c     3.0
d     6.0
e    10.0
Name: Ohio, dtype: float64

In [77]:
obj2 = obj.drop('c')
obj2

a     0.0
b    10.0
d     6.0
e    10.0
Name: Ohio, dtype: float64

In [79]:
obj3 = obj.drop(['c','d'])
obj3

a     0.0
b    10.0
e    10.0
Name: Ohio, dtype: float64

In [80]:
data1 = pd.DataFrame(np.arange(16).reshape(4,4), 
                    index = ['Ohio','Colorado','Utah', 'NY'], 
                    columns=['one','two','three','four'])
data1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [81]:
data1.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [82]:
data1.drop(columns='two')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NY         12     14    15

## Indexing, Selection and Filtering

In [85]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [86]:
obj['b']

1.0

In [87]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [88]:
obj[['b','d']]

b    1.0
d    3.0
dtype: float64

In [89]:
obj[[1,2]]

b    1.0
c    2.0
dtype: float64

In [90]:
obj.loc[['a','b']]

a    0.0
b    1.0
dtype: float64

In [91]:
obj.iloc[1:3]

b    1.0
c    2.0
dtype: float64

In [92]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [93]:
obj1

2    1
0    2
1    3
dtype: int64

In [94]:
obj2

a    1
b    2
c    3
dtype: int64

In [95]:
obj1[[1,2,0]]

1    3
2    1
0    2
dtype: int64

In [97]:
obj2[[1,2,0]]

b    2
c    3
a    1
dtype: int64

In [98]:
 obj.loc[[0, 1, 2]] #fail

KeyError: "None of [Index([0, 1, 2], dtype='int32')] are in the [index]"

In [99]:
 obj.iloc[[0, 1, 2]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [100]:
# Assigning values using indexing

obj.loc["b":"c"] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [101]:
data1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [102]:
data1['two']

Ohio         1
Colorado     5
Utah         9
NY          13
Name: two, dtype: int32

In [103]:
data1[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
NY         13    15

In [104]:
data1[1:3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [105]:
data1[data1.three>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NY         12   13     14    15

In [106]:
data1<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
NY        False  False  False  False

In [107]:
data1.loc['NY']

one      12
two      13
three    14
four     15
Name: NY, dtype: int32

In [108]:
data1.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [109]:
data1.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    4    5      6     7

In [110]:
data1.loc[data1.three ==6]['three'] =5

C:\Users\NEXT\AppData\Local\Temp\ipykernel_1608\354630880.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data1.loc[data1.three ==6]['three'] =5

In [111]:
data1.loc[data1.three ==6,'three'] =5
data1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      5     7
Utah        8    9     10    11
NY         12   13     14    15